<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>心蛛小站</title>
  <link href="http://exaos.github.com/index.xml" rel="self" />
  <link href="http://exaos.github.com/"/>
  <updated>2012-04-16T10:03:48Z</updated>
  <id>http://exaos.github.com/index.xml</id>
  <entry><title type="html">强迫症 (OCD) 者的计算机使用表现</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/04/16_computer-ocd-users.html"/><updated>2012-04-16T09:52:00Z</updated><published>2012-04-16T09:52:00Z</published><id>blog/2012/04/16_computer-ocd-users.html</id><category scheme="/tags/ocd.html" term="OCD" label="OCD"/><category scheme="/tags/8a2b56e293ee788f1057ad236e06559e.html" term="计算机" label="计算机"/><content type="html">&lt;p&gt;
&#25105;&#31616;&#21333;&#32473;&#20986;&#19968;&#20010;&#21015;&#34920;&#65292;&#35752;&#35770;&#19968;&#19979;&#26576;&#31867;&#29992;&#25143;&#20351;&#29992;&#35745;&#31639;&#26426;&#30340;&#34920;&#29616;&#65306;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&lt;b&gt;&#23545;&#24037;&#20855;&#26412;&#36523;&#30340;&#20851;&#27880;&#36828;&#36828;&#36229;&#20986;&#23545;&#20351;&#29992;&#24037;&#20855;&#35201;&#23436;&#25104;&#30340;&#30446;&#26631;&#30340;&#20851;&#27880;&#65281;&lt;/b&gt;
&lt;ul&gt;
&lt;li&gt;&#23547;&#25214;&#24037;&#20855;&#30340;&#26102;&#38388;&#36828;&#36828;&#36229;&#36807;&#20351;&#29992;&#24037;&#20855;&#30340;&#26102;&#38388;&#12290;
&lt;/li&gt;
&lt;li&gt;&#23547;&#25214;&#20102;&#35768;&#22810;&#24037;&#20855;&#65292;&#24182;&#36827;&#34892;&#23545;&#27604;&#65292;&#21916;&#27426; &lt;a href="http://wikivs.com/"&gt;Wiki VS&lt;/a&gt;, &#21916;&#27426; Emacs/Vim, Gnome/KDE &#31561;&#30456;&#20851;&#30340;&#35770;&#25112;&#12290;
&lt;/li&gt;
&lt;li&gt;&#36807;&#24230;&#39057;&#32321;&#22320;&#21319;&#32423;&#65292;&#21738;&#24597;&#26681;&#26412;&#29992;&#19981;&#19978;&#65292;&#20063;&#38750;&#35201;&#20808;&#21319;&#32423;&#19978;&#21435;&#20102;&#25165;&#24515;&#23433;&#12290;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;li&gt;&lt;b&gt;&#25910;&#38598;&#36164;&#26009;&#25104;&#30294;&lt;/b&gt;, &#21916;&#27426;&#25226;&#36164;&#26009;&#20998;&#31867;&#25972;&#29702;&#65307;&#25991;&#20214;&#21517;&#24517;&#39035;&#35201;&#25972;&#40784;&#26377;&#24207;&#65292;&#19981;&#20572;&#22320;&#25972;&#29702;&#25991;&#26723;
&lt;ul&gt;
&lt;li&gt;&#20320;&#30340;&#30828;&#30424;&#20013;&#38500;&#30005;&#24433;&#12289;&#38899;&#20048;&#20043;&#22806;&#65292;&#26159;&#19981;&#26159;&#26377;&#19978;&#30334; GB &#29978;&#33267;&#19978; TB &#37327;&#32423;&#30340;&#21508;&#31867;&#36164;&#26009;&#65311;&#26159;&#19981;&#26159;
    &#25972;&#40784;&#26377;&#24207;&#65311;&#25105;&#26377;&#65292;&#30446;&#21069;&#21150;&#20844;&#29992;&#26426;&#22120;&#30340;&#31181;&#31867;&#36164;&#26009;&#26377; 600 GB &#22810;&#65292;&#23478;&#29992;&#26426;&#22120;&#26377; 400 GB &#22810;
    (&#36825;&#20123;&#19981;&#21253;&#25324;&#30005;&#24433;&#12289;&#38899;&#20048;&#31561;&#65292;&#23427;&#20204;&#21482;&#21344;&#24456;&#23569;&#30340;&#19968;&#37096;&#20998;), &#24182;&#19988;&#36825;&#20123;&#25991;&#20214;&#37117;&#25972;&#40784;&#26377;&#24207;&#65292;&#25105;&#21487;
    &#20197;&#19981;&#29992;&#20219;&#20309;&#25628;&#32034;&#24037;&#20855;&#24456;&#24555;&#22320;&#25214;&#21040;&#29305;&#23450;&#30340;&#36164;&#26009;&#12290;
&lt;/li&gt;
&lt;li&gt;&#20320;&#26159;&#19981;&#26159;&#29305;&#21916;&#27426;&#25910;&#38598;&#21508;&#31867;&#36719;&#20214;&#65311;&#19981;&#21516;&#29256;&#26412;&#65311;&#25105;&#26377;&#65292;&#24182;&#19988;&#29305;&#21916;&#27426;&#25910;&#38598;&#21508;&#31867;&#36328;&#24179;&#21488;&#30340;&#36719;&#20214;&#12290;
&lt;/li&gt;
&lt;li&gt;&#26377;&#27809;&#26377;&#25910;&#38598;&#28304;&#30721;&#20179;&#24211;&#30340;&#30294;&#22909;&#65311;&#25105;&#26377;&#65292;&#30446;&#21069;&#25910;&#38598;&#30340;&#26377;&#21313;&#22810; GB &#30340;&#28304;&#30721;&#65292;&#24182;&#19988;&#29305;&#24847;&#32534;&#20889;&#20102;&#31649;
    &#29702;&#36825;&#20123;&#28304;&#30721;&#30340;&#33050;&#26412;&#31243;&#24207;&#12290;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;li&gt;&lt;b&gt;&#20572;&#19981;&#19979;&#26469;&#20570;&#26576;&#20214;&#20107;&#24773;&lt;/b&gt;
&lt;ul&gt;
&lt;li&gt;&#20320;&#26377;&#27809;&#26377;&#27599;&#38548;&#20960;&#20998;&#38047;&#23601;&#35201;&#21040;&#24494;&#21338;&#12289;Google Reader&#12289;BBS &#25110;&#32773; RSS &#38405;&#35835;&#22120;&#20013;&#30475;&#19968;&#30524;&#65311;&#22914;
    &#26524;&#27809;&#30475;&#65292;&#23601;&#35273;&#24471;&#24515;&#37324;&#27809;&#30528;&#27809;&#33853;&#30340;&#38590;&#21463;&#65311;&#21578;&#35785;&#20320;&#65292;&#25105;&#20174; 2006 &#24180;&#20197;&#26469;&#65292;&#22312; Google Reader
    &#19978;&#24050;&#32463;&#38405;&#35835;&#20102;&#26377; 2 &#19975;&#22810;&#20010;&#26465;&#30446;&#65292;&#20854;&#20013;&#19981;&#21253;&#25324;&#37027;&#20123;&#30452;&#25509;&#28857;&#20987;&#24050;&#35835;&#30340;&#65292;&#32780; Google Reader
    &#31639;&#26159;&#25105;&#30331;&#38470;&#27604;&#36739;&#23569;&#32593;&#32476;&#26381;&#21153;&#20043;&#19968;&#12290;&#33267;&#20110;&#24494;&#21338;&#12289;BBS&#12289;&#35770;&#22363;&#65292;&#27599;&#22825;&#37117;&#35201;&#32791;&#25481;&#22823;&#37327;&#30340;&#26102;&#38388;&#65292;&#20960;
    &#20046;&#27599;&#38548;&#20960;&#20998;&#38047;&#23601;&#35201;&#21435;&#26597;&#30475;&#19968;&#27425;&#30340;&#37027;&#31181;&#12290;
&lt;/li&gt;
&lt;li&gt;&#20351;&#29992; ArchLinux, &#27599;&#38548;&#20960;&#20010;&#23567;&#26102;&#65292;&#37117;&#35201;&#25191;&#34892;&#19968;&#27425; &lt;code&gt;pacman -Syu&lt;/code&gt;! &#22914;&#26524;&#20986;&#24046;&#25110;&#32773;&#20854;&#23427;&#21407;
    &#22240;&#26410;&#33021;&#25191;&#34892;&#36825;&#20010;&#21629;&#20196;&#65292;&#24515;&#20013;&#20250;&#24863;&#21040;&#25233;&#37057;&#65292;&#24863;&#35273;&#23569;&#20102;&#20123;&#20160;&#20040;&#12290;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;li&gt;&#31163;&#24320;&#35745;&#31639;&#26426;&#23601;&#20250;&#20986;&#29616;&#27822;&#20007;&#12289;&#24656;&#24807;&#12289;&#28966;&#34385;&#12289;&#32039;&#24352;&#12289;&#26131;&#28608;&#21160;&#31561;&#24773;&#32490;&#65311;&#25105;&#26377;&#65281;
&lt;/li&gt;
&lt;li&gt;&#31163;&#24320;&#35745;&#31639;&#26426;&#65292;&#27880;&#24847;&#21147;&#26080;&#27861;&#38598;&#20013;&#20110;&#26576;&#20123;&#20107;&#24773;&#65292;&#27604;&#22914;&#35835;&#20070;&#12289;&#27427;&#36175;&#33457;&#33609;&#12289;&#37066;&#28216;&#31561;&#65311;&#25105;&#26377;&#65281;
&lt;/li&gt;
&lt;li&gt;&#24635;&#35273;&#24471;&#33258;&#24049;&#30340;&#35745;&#31639;&#26426;&#19981;&#22815;&#29992;&#65292;&#23427;&#30340;&#21151;&#33021;&#19981;&#22815;&#24378;&#22823;&#65311;&#24635;&#24076;&#26395;&#36141;&#20080;&#26356;&#26032;&#26356;&#24555;&#30340;&#37197;&#20214;&#65311;&#25105;&#26377;&#65281;
&lt;/li&gt;
&lt;li&gt;&#30475;&#21040;&#21035;&#20154;&#30340;&#35745;&#31639;&#26426;&#35013;&#28385; 360 &#20043;&#31867;&#30340;&#27969;&#27667;&#36719;&#20214;&#20250;&#24515;&#29702;&#38590;&#21463;&#65311;&#25105;&#26377;&#65281;
&lt;/li&gt;
&lt;li&gt;&#35273;&#24471;&#21035;&#20154;&#20351;&#29992;&#35745;&#31639;&#26426;&#30340;&#26576;&#20123;&#20064;&#24815;&#29305;&#34850;&#20250;&#24515;&#29702;&#38590;&#21463;&#65311;&#25105;&#26377;&#65281;
&lt;/li&gt;
&lt;li&gt;&#24525;&#19981;&#20303;&#24819;&#25945;&#21035;&#20154;&#22914;&#20309;&#26356;&#24555;&#25463;&#22320;&#20351;&#29992;&#35745;&#31639;&#26426;&#65311;&#25105;&#26377;&#26102;&#20250;&#24525;&#19981;&#20303;&#12290; &lt;code&gt;:-(&lt;/code&gt;
&lt;/li&gt;
&lt;/ul&gt;


&lt;p&gt;
&#22909;&#20102;&#65292;&#19981;&#29992;&#20877;&#32599;&#21015;&#20102;&#65281;&#25105;&#24819;&#65292;&#19978;&#36848;&#30340;&#36825;&#20123;&#34920;&#29616;&#22914;&#26524;&#37117;&#26377;&#30340;&#35805;&#65292;&#19981;&#24471;&#19981;&#35828;: &lt;br/&gt;
&lt;b&gt;&#24685;&#21916;&#65281;&#20320;&#26159;&#20010;&#20351;&#29992;&#35745;&#31639;&#26426;&#30340;&#24378;&#36843;&#30151;&#32773;&#65281;&lt;/b&gt;
&lt;/p&gt;
&lt;p&gt;
&lt;a href="http://en.wikipedia.org/wiki/OCD"&gt;&#24378;&#36843;&#30151;&lt;/a&gt; &#26159;&#28966;&#34385;&#30151;&#30340;&#19968;&#31867;&#65292;&#20854;&#29305;&#28857;&#26159;&#22914;&#26524;&#19981;&#37325;&#22797;&#20570;&#26576;&#20123;&#20107;&#24773;&#65292;&#23601;&#20250;&#20986;&#29616;&#19981;&#23433;&#12289;&#24656;&#24807;&#12289;&#25285;&#24551;&#31561;&#24773;
&#32490;&#65292;&#20063;&#21482;&#26377;&#36890;&#36807;&#37325;&#22797;&#20570;&#26576;&#31867;&#20107;&#24773;&#25165;&#33021;&#22815;&#32531;&#35299;&#12290;&#24378;&#36843;&#30151;&#26159;&#32654;&#22269;&#31532;&#22235;&#22823;&#24120;&#35265;&#30340;&#31934;&#31070;&#22833;&#35843;&#65292;&#23427;&#19982;&#21742;
&#21912;&#12289;&#31958;&#23615;&#30149;&#19968;&#26679;&#24120;&#35265;&#65288;&#27880;&#24847;&#65292;&#24378;&#36843;&#30151;&#19982; &lt;a href="http://en.wikipedia.org/wiki/Obsessive&#8211;compulsive_personality_disorder"&gt;&#24378;&#36843;&#24615;&#20154;&#26684;&lt;/a&gt; &#24182;&#19981;&#19968;&#26679;&#65289;&#12290;&#26681;&#25454;&#30456;&#20851;&#36164;&#26009;&#65292;&#24378;&#36843;&#30151;&#32773;
&#22810;&#25317;&#26377;&#36739;&#24378;&#30340;&#32852;&#24819;&#21644;&#24819;&#35937;&#21147;&#65292;&#26234;&#21830;&#19968;&#33324;&#20063;&#39640;&#20110;&#24120;&#20154;&#65292;&#20294;&#38271;&#26399;&#32570;&#20047;&#23433;&#20840;&#24863;&#65292;&#23545;&#26576;&#20123;&#26041;&#38754;&#30340;&#25285;&#24551;
&#25345;&#32493;&#23384;&#22312;&#65292;&#23545;&#29616;&#23454;&#30340;&#24863;&#30693;&#21147;&#26377;&#25152;&#19979;&#38477;&#31561;&#65292;&#20250;&#23548;&#33268;&#31867;&#20284;&#30340;&#21518;&#26524;&#12290;&#21478;&#22806;&#65292;&#20307;&#20869;&#30340;&#34880;&#28165;&#32032;&#12289;&#22810;&#24052;&#33018;
&#30340;&#19981;&#24179;&#34913;&#12289;&#29615;&#22659;&#22240;&#32032;&#31561;&#20063;&#21487;&#33021;&#26159;&#35825;&#22240;&#12290;&#23545;&#20110;&#24378;&#36843;&#30151;&#30340;&#30149;&#22240;&#65292;&#36824;&#26377;&#20854;&#23427;&#30340;&#35828;&#27861;&#12290;&#20294;&#19968;&#33324;&#35748;&#20026;&#65292;
&#23545;&#30149;&#24773;&#36739;&#36731;&#30340;&#20351;&#29992;&#35299;&#37322;&#24615;&#30340;&#24515;&#29702;&#27835;&#30103;&#21644;&#33647;&#29289;&#36741;&#21161;&#21363;&#21487;&#65292;&#36824;&#26377;&#23601;&#26159; &lt;a href="http://en.wikipedia.org/wiki/Morita_therapy"&gt;&#26862;&#30000;&#30103;&#27861;&lt;/a&gt;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#35745;&#31639;&#26426;&#20351;&#29992;&#20013;&#30340;&#24378;&#36843;&#30151;&#65292;&#20284;&#20046;&#39034;&#20854;&#33258;&#28982;&#20063;&#26080;&#19981;&#21487;&#12290;&#20294;&#26377;&#20123;&#26102;&#20505;&#36825;&#31181;&#29366;&#24577;&#20250;&#24433;&#21709;&#29616;&#23454;&#29983;&#27963;
&#20013;&#30340;&#20854;&#23427;&#26041;&#38754;&#65292;&#27604;&#22914;&#23478;&#24237;&#27675;&#22260;&#12289;&#24037;&#20316;&#35745;&#21010;&#31561;&#65292;&#29978;&#33267;&#23545;&#29992;&#25143;&#30340;&#29983;&#29702;&#20581;&#24247;&#20063;&#36896;&#25104;&#19968;&#23450;&#30340;&#24433;&#21709;&#12290;&#22240;
&#27492;&#65292;&#19981;&#22952;&#35835;&#19968;&#35835;&#26862;&#30000;&#30103;&#27861;&#65292;&#33258;&#34892;&#20570;&#19968;&#28857;&#25913;&#21464;&#12290;&#20294;&#25105;&#26356;&#20048;&#24847;&#25512;&#33616;&#30340;&#26159;&#20351;&#29992; &lt;a href="http://en.wikipedia.org/wiki/Getting_Things_Done"&gt;GTD&lt;/a&gt; &#21644; &lt;a href="http://en.wikipedia.org/wiki/Pomodoro_Technique"&gt;&#30058;&#33540;&#24037;&#20316;&#27861;&lt;/a&gt;
&#26469;&#31649;&#29702;&#20320;&#30340;&#26085;&#24120;&#29983;&#27963;&#12290;&#24403;&#28982;&#65292;&#35831;&#19981;&#35201;&#22312;&#25910;&#38598;&#19968;&#22823;&#22534;&#30340;&#36825;&#31867;&#36164;&#26009;&#21518;&#65292;&#25226;&#26041;&#27861;&#26412;&#36523;&#37117;&#24536;&#35760;&#21949;&#65281;&#26082;
&#28982;&#21487;&#20197;&#24378;&#36843;&#30528;&#21435;&#20570;&#20854;&#23427;&#20107;&#24773;&#65292;&#19981;&#22952;&#30495;&#27491;&#24378;&#36843;&#33258;&#24049;&#19968;&#22238;&#65292;&#25226;&#36825;&#20004;&#31181;&#26041;&#27861;&#24212;&#29992;&#36215;&#26469;&#65281;
&lt;/p&gt;
</content></entry><entry><title type="html">Emacs --- 能够显示地图的编辑器？</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/04/14_my-emacs-usage.html"/><updated>2012-04-14T19:57:00Z</updated><published>2012-04-14T19:57:00Z</published><id>blog/2012/04/14_my-emacs-usage.html</id><category scheme="/tags/orgmode.html" term="orgmode" label="orgmode"/><category scheme="/tags/emacs.html" term="Emacs" label="Emacs"/><category scheme="/tags/ocd.html" term="OCD" label="OCD"/><content type="html">&lt;p&gt;
&#20170;&#22825;&#36716;&#31227;&#21040;&#20102; Windows 7 64-bit &#19979;&#20570;&#28857;&#20107;&#24773;&#65292;&#22312;&#20351;&#29992; Emacs &#26102;&#20986;&#29616;&#20102;&#35768;&#22810;&#38382;&#39064;&#65306;&#39318;&#20808;&#65292;&#31243;
&#24207;&#25171;&#24320;&#22833;&#21435;&#21709;&#24212;&#65292;&#21518;&#26469;&#21457;&#29616;&#26159; NTFS &#25991;&#20214;&#31995;&#32479;&#20986;&#38169;&#65292;&#37325;&#21551;&#31995;&#32479;&#36827;&#34892;&#30828;&#30424;&#26816;&#26597;&#21518;&#25490;&#38500;&#65307;&#20877;&#21518;&#26469;
&#21457;&#29616;&#25105;&#30340; &lt;a href="http://orgmode.org/"&gt;org-mode&lt;/a&gt; &#35774;&#32622;&#20013;&#30340; &lt;code&gt;org-contacts&lt;/code&gt; &#24037;&#20316;&#19981;&#27491;&#24120;&#65292;&#20986;&#29616;&#22914;&#19979;&#38169;&#35823;&#65306;
&lt;/p&gt;


&lt;pre class="example"&gt;File mode specification error: (wrong-type-argument number-or-marker-p nil) [4 times]
Bad sexp at line 27 in d:/Exaos/Workspace/exaos/daily/myorg/contacts.org: (org-contacts-anniversaries)
Preparing diary...done
Preparing diary...done
Bad sexp at line 27 in d:/Exaos/Workspace/exaos/daily/myorg/contacts.org: (org-contacts-anniversaries)
...
&lt;/pre&gt;

&lt;p&gt;
&#25628;&#32034;&#20102;&#19968;&#32763;&#65292;&#20173;&#28982;&#27809;&#26377;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292; &lt;code&gt;org-contacts&lt;/code&gt; &#24050;&#32463;&#27491;&#30830;&#21152;&#36733;&#20102;&#65292;&#20294;&#22312;&#25105;&#30340;
&#32852;&#31995;&#20154;&#21015;&#34920;&#20013;&#26377;&#19968;&#20123;&#20154;&#30340;&#29983;&#26085;&#35201;&#26089;&#20110; 1970 &#24180;&#65292;&#36825;&#20010;&#22312; 32-&#20301;&#30340; Emacs &#19978;&#20284;&#20046;&#26080;&#27861;&#35299;&#20915;&#12290;
&#65288;&#21442;&#35265; &lt;a href="http://goo.gl/WNmi4"&gt;Stack Overflow&lt;/a&gt; &#19978;&#30340;&#30456;&#20851;&#25552;&#38382;&#65292;&#20854;&#20013;&#26377;&#25105;&#30340;&#27880;&#37322;&#12290;&#65289;
&lt;/p&gt;
&lt;p&gt;
&#22312;&#35843;&#35797;&#36825;&#20010;&#38382;&#39064;&#30340;&#36807;&#31243;&#65292;&#25105;&#21457;&#29616;&#26032;&#29256;&#30340; &lt;code&gt;org-mode&lt;/code&gt; &#20013;&#33258;&#24102;&#30340; &lt;code&gt;org-contacts&lt;/code&gt; &#26032;&#28155;&#20102;&#19968;&#20010;
&#21151;&#33021;&#65306;&#22312; google &#22320;&#22270;&#19978;&#26174;&#31034;&#32852;&#31995;&#20154;&#30340;&#22320;&#22336;&#12290;&#65288;&#24403;&#28982;&#65292;&#36825;&#20010;&#22320;&#22270;&#26159;&#22312; Emacs &#20013;&#26174;&#31034;&#30340;&#21734;&#12290;&#65289;
&lt;b&gt;&#20320;&#26377;&#24819;&#36807;&#22312;&#32534;&#36753;&#22120;&#20013;&#26174;&#31034; Google &#22320;&#22270;&#21527;&#65311;&lt;/b&gt; Emacs &#23601;&#21487;&#20197;&#65292;&#19981;&#36807;&#65292;&#33021;&#22815;&#26174;&#31034;&#22320;&#22270;&#30340;&#32534;&#36753;&#22120;
&#36824;&#33021;&#31639;&#26159;&#21333;&#32431;&#30340;&#32534;&#36753;&#22120;&#21527;&#65311;&#25152;&#20197;&#65292;&#26377;&#20154;&#35828;&#65292; Emacs &#19981;&#24212;&#35813;&#21483;&#32534;&#36753;&#22120;&#65292;&#24212;&#35813;&#21483;&#22522;&#20110;&#32534;&#36753;&#22120;&#30340;&#25805;
&#20316;&#31995;&#32479;&#12290;&#20174;&#36825;&#31181;&#35843;&#20355;&#20013;&#21487;&#35265;&#36825;&#20010;&#36719;&#20214;&#30830;&#23454;&#26377;&#28857;&#29275;&#27668;&#20914;&#22825;&#12290;&#19981;&#36807;&#65292;&#20063;&#35768;&#20250;&#26377;&#20154;&#21453;&#39539;&#35828;&#65306;&#20063;&#26377;&#20854;
&#23427;&#30340;&#32534;&#36753;&#22120;&#33021;&#22815;&#26174;&#31034;&#22320;&#22270;&#65292;&#27604;&#22914;&#26576;&#26576; IDE &#20043;&#31867;&#30340;&#12290;&#25105;&#24819;&#35828;&#30340;&#26159;&#65292;&#37027;&#26159;&#22312;&#20854;&#23427;&#30340;&#36719;&#20214;&#20013;&#23884;&#20837;&#32534;
&#36753;&#22120;&#65292;&#32780; Emacs &#26159;&#22312;&#32534;&#36753;&#22120;&#20013;&#23884;&#20837;&#20854;&#23427;&#30340;&#36719;&#20214;&#65292;&#36825;&#20854;&#20013;&#30340;&#24494;&#22937;&#24046;&#24322;&#36824;&#38656;&#35201;&#20180;&#32454;&#20307;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#20851;&#20110; &lt;code&gt;google-maps.el&lt;/code&gt;, &#35831;&#21442;&#35265;&#65306; 
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href="http://julien.danjou.info/software/google-maps.el"&gt;http://julien.danjou.info/software/google-maps.el&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="http://git.naquadah.org/?p=google-maps.git"&gt;http://git.naquadah.org/?p=google-maps.git&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="http://julien.danjou.info/blog/2010/google-maps.el"&gt;http://julien.danjou.info/blog/2010/google-maps.el&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;


&lt;p&gt;
&#20294; elisp &#26412;&#36523;&#20063;&#26377;&#35768;&#22810;&#32570;&#28857;&#32780;&#34987;&#20154;&#35807;&#30149;&#12290;&#22240;&#27492;&#65292;&#26377;&#20154;&#24076;&#26395;&#37319;&#29992;&#20854;&#23427;&#35821;&#35328;&#26469;&#37325;&#26032;&#23454;&#29616; Emacs
&#31867;&#20284;&#30340;&#21151;&#33021;&#65292;&#27604;&#22914;&#65306;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&#20351;&#29992; &lt;a href="http://www.haskell.org/"&gt;Haskell&lt;/a&gt; &#30340; &lt;a href="http://www.haskell.org/haskellwiki/Yi"&gt;Yi (&#32681;)&lt;/a&gt; &#32534;&#36753;&#22120;
&lt;/li&gt;
&lt;li&gt;&#20351;&#29992; &lt;a href="http://en.wikipedia.org/wiki/Common_Lisp"&gt;Common Lisp&lt;/a&gt; &#30340; &lt;a href="http://common-lisp.net/project/climacs/"&gt;Climacs&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&#36824;&#26377;&#20154;&#22312;&#35745;&#21010;&#30528;&#20351;&#29992; &lt;a href="http://en.wikipedia.org/wiki/Scheme_(programming_language)"&gt;Scheme&lt;/a&gt; &#30340;&#26041;&#35328; &lt;a href="http://www.gnu.org/software/guile/"&gt;GNU Guile&lt;/a&gt; &#26469;&#37325;&#26032;&#23454;&#29616; Emacs, &#36825;&#20010;&#26377;&#28857;&#20540;&#24471;&#26399;&#24453;&#21727; ---
&lt;ul&gt;
&lt;li&gt;&lt;a href="http://lists.gnu.org/archive/html/emacs-devel/2010-04/msg00665.html"&gt;http://lists.gnu.org/archive/html/emacs-devel/2010-04/msg00665.html&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="http://lists.gnu.org/archive/html/emacs-devel/2012-04/msg00276.html"&gt;http://lists.gnu.org/archive/html/emacs-devel/2012-04/msg00276.html&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="http://www.google-melange.com/gsoc/proposal/review/google/gsoc2012/bpt/23002"&gt;http://www.google-melange.com/gsoc/proposal/review/google/gsoc2012/bpt/23002&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;/ul&gt;


&lt;p&gt;
&#24102;&#26377; Lisp &#26041;&#35328;&#32534;&#31243;&#29615;&#22659;&#30340; Emacs &#32534;&#36753;&#22120;&#20197;&#20854;&#28145;&#21402;&#30340;&#21382;&#21490;&#24863;&#12289;&#23454;&#29992;&#24615;&#21644;&#24378;&#22823;&#30340;&#25193;&#23637;&#21151;&#33021;&#65292;&#22312;
&#32534;&#36753;&#22120;&#31243;&#24207;&#20013;&#38590;&#26377;&#20986;&#26377;&#21491;&#32773;&#12290;&#20316;&#20026;&#38750;&#31243;&#24207;&#21592;&#30340;&#31243;&#24207;&#24320;&#21457;&#32773;&#65292;&#25105;&#29992;&#23427;&#20027;&#35201;&#23436;&#25104;&#19968;&#20123;&#22914;&#19979;&#30340;&#24037;&#20316;&#65306;
&lt;/p&gt;&lt;ol&gt;
&lt;li&gt;&#20889;&#25991;&#26723; (LaTeX)
&lt;/li&gt;
&lt;li&gt;&#20889;&#31243;&#24207; (C/C++, Python, Shell, Lua, &amp;hellip;)
&lt;/li&gt;
&lt;li&gt;&#20889;&#21338;&#23458; (org-mode + o-blog)
&lt;/li&gt;
&lt;li&gt;&#20889;&#26085;&#35760; (org-mode: Capture-Refile-Archive)
&lt;/li&gt;
&lt;li&gt;&#35835;&#25991;&#26723; (info + woman)
&lt;/li&gt;
&lt;li&gt;&#32487;&#32493;&#24320;&#21457;&#20013;&#21734; :-D
&lt;/li&gt;
&lt;/ol&gt;


&lt;p&gt;
&#20320;&#26159;&#21542;&#27880;&#24847;&#21040;&#26412;&#31687;&#21338;&#25991;&#30340;&#26631;&#31614;&#20013;&#21547;&#26377;&#19968;&#20010; &lt;b&gt;OCD&lt;/b&gt;? &#33267;&#20110;&#20160;&#20040;&#26159; OCD, &#25105;&#20204;&#19979;&#22238;&#35265;&#65281;
&lt;/p&gt;</content></entry><entry><title type="html">联合国大学 (UNU)</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/28_UNU.html"/><updated>2012-03-28T14:14:00Z</updated><published>2012-03-28T14:14:00Z</published><id>blog/2012/03/28_UNU.html</id><category scheme="/tags/ce4ba240fbd95d4863684f78453c8877.html" term="社会" label="社会"/><category scheme="/tags/8640cb1581c2ae2de5a1462405b2943b.html" term="教育" label="教育"/><content type="html">&lt;p&gt;
&#20197;&#21069;&#26377;&#20010;&#20013;&#21307;&#39575;&#23376;&#21016;&#22826;&#21307;&#65292;&#33258;&#31216;&#33719;&#24471;&#32852;&#21512;&#22269;&#22823;&#23398;&#31185;&#23398;&#19982;&#21307;&#23398;&#21452;&#21338;&#22763;&#12290;&#21407;&#20197;&#20026;&#36825;&#20010;&#8220;&#32852;&#21512;&#22269;&#22823;
&#23398;&#8221;&#26159;&#23376;&#34394;&#20044;&#26377;&#30340;&#65292;&#20180;&#32454;&#38405;&#35835;&#20102;&#19968;&#20123; &lt;a href="http://www.un.org"&gt;&#32852;&#21512;&#22269;&lt;/a&gt; &#30456;&#20851;&#20869;&#23481;&#21518;&#65292;&#25105;&#30693;&#36947;&#33258;&#24049;&#38169;&#20102;&#12290;&#20851;&#20110;&#8220;&#32852;&#21512;&#22269;
&#22823;&#23398;&#8221;&#30340;&#20449;&#24687;&#21442;&#35265;&#65306;&lt;a href="http://unu.edu/about"&gt;&#32852;&#21512;&#22269;&#22823;&#23398;&#20171;&#32461;&lt;/a&gt; &#20197;&#21450; &lt;a href="http://www.un.org/zh/development/progareas/global/research.shtml"&gt;&#32852;&#21512;&#22269;&#30740;&#31350;&#19982;&#22521;&#35757;&#20869;&#23481;&lt;/a&gt;&#12290;
&lt;/p&gt;
&lt;p&gt;
&lt;a href="http://unu.edu/" alt="&#32852;&#21512;&#22269;&#22823;&#23398;&#22270;&#26631;" title="&#32852;&#21512;&#22269;&#22823;&#23398;&#22270;&#26631;" align="center"&gt;&lt;img src="http://unu.edu/wp-content/mu-plugins/unu-framework/Common/BluePrint/images/logo.gif" alt="logo.gif"/&gt;&lt;/a&gt;
&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#22269;&#22823;&#23398;&#26159;&#32852;&#21512;&#22269;&#31995;&#32479;&#20013;&#30340;&#23398;&#26415;&#20998;&#25903;&#65292;&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#39046;&#22495;&#24320;&#23637;&#19968;&#20123;&#30740;&#31350;&#19982;&#25945;&#32946;&#27963;&#21160;&#65292;&#20854;&#29305;
&#21035;&#30446;&#30340;&#26159;&#36741;&#21161;&#21457;&#23637;&#20013;&#22269;&#23478;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#23427;&#30001;&#32852;&#21512;&#22269;&#22823;&#20250;&#20110;1973&#24180;&#21019;&#31435;&#65292;&#26088;&#22312;&#25104;&#20026;&#8220;&#19968;&#20010;&#22269;&#38469;&#24615;&#30340;&#23398;&#26415;&#31038;&#22242;&#65292;&#20026;&#20419;&#36827;&#32852;&#21512;&#22269;&#23466;&#31456;&#30340;&#30446;
&#30340;&#19982;&#21407;&#21017;&#32780;&#24320;&#23637;&#30740;&#31350;&#12289;&#36827;&#20462;&#19982;&#26222;&#21450;&#24037;&#20316;&#8221;&#12290;&#32852;&#21512;&#22269;&#22823;&#23398;&#36890;&#36807;&#20840;&#29699;&#24615;&#30340;&#32852;&#21512;&#30740;&#31350;&#26426;&#26500;&#36827;&#34892;&#36816;
&#20316;&#65292;&#22312;&#20301;&#20110;&#19996;&#20140;&#30340;&#32852;&#21512;&#22269;&#22823;&#23398;&#20013;&#24515;&#30340;&#25351;&#23548;&#19979;&#25191;&#34892;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#22269;&#22823;&#23398;&#24535;&#22312;&#25104;&#20026;&#22269;&#38469;&#19968;&#27969;&#30340;&#30740;&#31350;&#12289;&#25945;&#32946;&#21644;&#33021;&#21147;&#22521;&#20859;&#30340;&#30740;&#31350;&#26426;&#26500;&#65292;&#22312;&#21644;&#24179;&#12289;&#21457;&#23637;&#21644;&#21487;&#25345;&#32493;
&#24615;&#26041;&#38754;&#25552;&#20379;&#20840;&#29699;&#24615;&#30340;&#25351;&#23548;&#12290;&#32852;&#21512;&#22269;&#22823;&#23398;&#20316;&#20026;&#32852;&#21512;&#22269;&#31995;&#32479;&#30340;&#26234;&#22218;&#22242;&#65292;&#22312;&#32852;&#21512;&#22269;&#12289;&#22269;&#38469;&#23398;&#26415;&#30028;&#21644;
&#25919;&#31574;&#21046;&#23450;&#22242;&#20307;&#38388;&#29301;&#32447;&#25645;&#26725;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#20026;&#23547;&#27714;&#24212;&#23545;&#20840;&#29699;&#24615;&#25361;&#25112;&#30340;&#21487;&#25345;&#32493;&#35299;&#20915;&#26041;&#26696;&#36827;&#34892;&#31995;&#32479;&#24615;&#30340;&#25506;&#32034;&#65292;&#22823;&#23398;&#30340;&#27963;&#21160;&#21487;&#20998;&#20026;&#20116;&#31867;&#30456;&#20114;&#20132;
&#32455;&#30340;&#39046;&#22495;&#65306;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&#21644;&#24179;&#12289;&#23433;&#20840;&#21644;&#20154;&#26435;
&lt;/li&gt;
&lt;li&gt;&#21457;&#23637;&#31649;&#29702;
&lt;/li&gt;
&lt;li&gt;&#20154;&#21475;&#21644;&#20581;&#24247;
&lt;/li&gt;
&lt;li&gt;&#20840;&#29699;&#21464;&#21270;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;
&lt;/li&gt;
&lt;li&gt;&#31185;&#23398;&#12289;&#25216;&#26415;&#21644;&#31038;&#20250;
&lt;/li&gt;
&lt;/ul&gt;

</content></entry><entry><title type="html">用中子探测器识别核武器</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/27_4207ab14665cc8d016faa74461b58c5d.html"/><updated>2012-03-27T23:37:00Z</updated><published>2012-03-27T23:37:00Z</published><id>blog/2012/03/27_4207ab14665cc8d016faa74461b58c5d.html</id><category scheme="/tags/920632dabac77e0e51002a969396ea04.html" term="物理" label="物理"/><content type="html">&lt;p&gt;
&#21407;&#25991;&#65306;Neutron detector can identify presence of nuclear weapons
&lt;a href="http://goo.gl/E4WWZ" target="_blank"&gt;&lt;img src="http://goo.gl/048rz" /&gt;&lt;/a&gt;

&#29275;&#27941;&#22823;&#23398;&#21644;&#20262;&#25958;&#24093;&#22269;&#23398;&#38498;&#30340;&#31185;&#23398;&#23478;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#20302;&#25104;&#26412;&#12289;&#39640;&#28789;&#25935;&#30340;&#20013;&#23376;&#25506;&#27979;&#22120;&#65292;&#21487;&#29992;&#20110;&#35782;&#21035;
&#26680;&#27494;&#22120;&#12290;&#20013;&#23376;&#25506;&#27979;&#22120;&#21253;&#21547;&#30340;&#21457;&#20809;&#37096;&#20214;&#31216;&#20043;&#20026;&#38378;&#28865;&#20307;&#65292;&#36825;&#26159;&#20013;&#23376;&#19982;&#20043;&#21457;&#29983;&#21453;&#24212;&#30340;&#22320;&#26041;&#12290;&#20197;&#21069;&#36890;
&#24120;&#20351;&#29992;&#27686;-3&#20803;&#32032;&#20316;&#20026;&#38378;&#28865;&#20307;&#12290;&#21313;&#22810;&#24180;&#21069;&#65292;&#32654;&#22269;&#30340;&#35768;&#22810;&#20891;&#24037;&#39033;&#30446;&#37117;&#33021;&#22815;&#29983;&#20135;&#27686;-3&#65292;&#29616;&#22312;&#36825;&#20123;&#39033;
&#30446;&#22810;&#25968;&#24050;&#32463;&#32467;&#26463;&#65292;&#24182;&#19988;&#27686;-3&#22312;&#21307;&#29992;&#21644;&#31185;&#23398;&#30740;&#31350;&#19978;&#20351;&#29992;&#20063;&#36234;&#26469;&#36234;&#24191;&#27867;&#65292;&#23548;&#33268;&#20215;&#26684;&#39134;&#28072;&#12290;&#35813;&#22242;&#38431;
&#29616;&#22312;&#35774;&#35745;&#30340;&#25506;&#27979;&#22120;&#20351;&#29992;&#30340;&#26159;&#38146;-6&#20803;&#32032;&#20316;&#20026;&#38378;&#28865;&#20307;&#65292;&#36825;&#31181;&#20803;&#32032;&#30340;&#33258;&#28982;&#30028;&#21547;&#37327;&#20016;&#23500;&#65292;&#20215;&#26684;&#20063;&#24456;&#20415;
&#23452;&#12290;&#24182;&#19988;&#36825;&#31181;&#26032;&#30340;&#25506;&#27979;&#22120;&#21487;&#26377;&#25928;&#21306;&#20998;&#20285;&#29595;&#23556;&#32447;&#30340;&#20449;&#21495;&#65292;&#35823;&#25253;&#35686;&#30340;&#27010;&#29575;&#20063;&#27604;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#20854;&#23454;&#65292;&#36825;&#31181;&#20013;&#23376;&#25506;&#27979;&#22120;&#19981;&#31639;&#20160;&#20040;&#26032;&#40092;&#30340;&#19996;&#35199;&#12290;&#20294;&#22914;&#26524;&#22312;&#28023;&#20851;&#12289;&#36828;&#33322;&#31561;&#22320;&#26041;&#30340;&#21361;&#38505;&#22120;&#26816;&#27979;&#20043;&#31867;
&#24212;&#29992;&#19978;&#24471;&#21040;&#24191;&#27867;&#25512;&#24191;&#20063;&#19981;&#38169;&#12290;
&lt;/p&gt;</content></entry><entry><title type="html">一些关于宇宙与粒子物理的科普网站作品</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/27_cosmos.html"/><updated>2012-03-27T09:48:00Z</updated><published>2012-03-27T09:48:00Z</published><id>blog/2012/03/27_cosmos.html</id><category scheme="/tags/920632dabac77e0e51002a969396ea04.html" term="物理" label="物理"/><category scheme="/tags/4a27f6167d4c1d052343a084b6a90b10.html" term="科学" label="科学"/><content type="html">&lt;p&gt;
&#21407;&#26469;&#22312; &lt;a href="http://weibo.com/1746729234/yalyzwZ4x"&gt;&#26032;&#28010;&#24494;&#21338;&lt;/a&gt; &#19978;&#21457;&#24067;&#36807;&#36825;&#26465;&#28040;&#24687;&#12290;&#22240;&#20026;&#35273;&#24471;&#36825;&#26159;&#20123;&#24456;&#26834;&#30340;&#19996;&#35199;&#65292;&#20540;&#24471;&#35760;&#24518;&#65292;&#25925;&#22312;&#36825;&#20799;&#25972;
&#29702;&#19968;&#19979;&#12290;
&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&#20320;&#26159;&#19981;&#26159;&#20250;&#22909;&#22855;&#65306;&#25105;&#20204;&#23431;&#23449;&#30340;&#23610;&#24230;&#31350;&#31455;&#26377;&#22810;&#22823;&#21602;&#65311;&#20854;&#23454;&#65292;&#30446;&#21069;&#20154;&#31867;&#25152;&#35748;&#35782;&#30340;&#23431;&#23449;&#21487;&#20197;&#35828;&#24050;
   &#32463;&#36828;&#36828;&#36229;&#20986;&#20102;&#26222;&#36890;&#20154;&#30340;&#30452;&#35266;&#24863;&#21463;&#33539;&#22260;&#12290;&#20294;&#25105;&#20204;&#20173;&#28982;&#21487;&#20197;&#27604;&#36739;&#24418;&#35937;&#22320;&#20307;&#39564;&#19968;&#19979;&#36825;&#20010;&#35748;&#35782;&#30340;&#23610;
   &#24230;&#65292;&#27427;&#36175;&#19968;&#19979;&#30001; Cary Huang &#25152;&#21046;&#20316;&#30340; flash &amp;mdash; &lt;a href="http://htwins.net/scale2/scale2.swf"&gt;&lt;b&gt;&#23431;&#23449;&#30340;&#23610;&#24230; 2&lt;/b&gt;&lt;/a&gt; (The Scale of the
   Universe 2). &#30446;&#21069;&#36824;&#27809;&#26377;&#32763;&#35793;&#25104;&#20013;&#25991;&#65292;&#27427;&#36175;&#26102;&#35831;&#24102;&#19978;&#35789;&#20856;&#12290;&#65339;&#27880;&#65306;&#25105;&#23545; Flash &#25216;&#26415;&#19981;&#24863;
   &#20852;&#36259;&#65292;&#22914;&#26524;&#26377;&#20154;&#24819;&#21046;&#20316;&#31867;&#20284;&#30340; HTML5/CSS &#39029;&#38754;&#65292;&#35831;&#19968;&#23450;&#21578;&#20043;&#25105;&#65281;&#21478;&#22806;&#65292;&#36825;&#20010;&#31449;&#28857;&#26368;&#21021;&#26159;
   &#20174; &lt;b&gt;&#26446;&#28156;&#22312;&#24494;&#21338;&lt;/b&gt; &#22312;&#26032;&#28010;&#19978;&#20998;&#20139;&#26102;&#25152;&#24471;&#65292;&#29305;&#27492;&#24863;&#35874;&#12290;&#65341;
&lt;/li&gt;
&lt;li&gt;&#21516;&#26679;&#65292;&#23545;&#20110;&#25105;&#20204;&#25152;&#29983;&#23384;&#30340;&#23431;&#23449;&#30340;&#35748;&#35782;&#36824;&#26377;&#21478;&#19968;&#31181;&#20197;&#26102;&#38388;&#26469;&#23637;&#29616;&#30340;&#26041;&#24335;&#65292;&#36825;&#23601;&#26159;&#24494;&#36719;&#30740;&#31350;&#20013;
   &#24515;&#12289;&#21152;&#24030;&#22823;&#23398;&#20271;&#20811;&#21033;&#20998;&#26657;&#21450;&#33707;&#26031;&#31185;&#24030;&#31435;&#22823;&#23398;&#25152;&#24102;&#26469;&#30340; &lt;a href="http://www.chronozoomproject.org/"&gt;&lt;b&gt;&#26102;&#38388;&#32553;&#25918;&#24037;&#31243;&lt;/b&gt;&lt;/a&gt; (ChronoZoom)&#12290;&#30475;
   &#30475;&#22312;&#26102;&#38388;&#30340;&#23610;&#24230;&#19978;&#20154;&#31867;&#30340;&#37027;&#31181;&#23490;&#23518;&#12290;
&lt;/li&gt;
&lt;li&gt;&#31890;&#23376;&#29289;&#29702;&#23545;&#26222;&#36890;&#20154;&#32780;&#35328;&#65292;&#26159;&#38750;&#24120;&#31070;&#31192;&#30340;&#19996;&#35199;&#12290;&#20854;&#23454;&#65292;&#23545;&#23427;&#30340;&#20102;&#35299;&#23613;&#31649;&#38656;&#35201;&#19968;&#23450;&#30340;&#22522;&#30784;&#30693;
   &#35782;&#65292;&#20294;&#20063;&#24182;&#38750;&#37027;&#20040;&#39640;&#19981;&#21487;&#25856;&#65292;&#20320;&#20063;&#21487;&#20197;&#22312;&#19981;&#20855;&#22791;&#25968;&#23398;&#29289;&#29702;&#22522;&#30784;&#30340;&#24773;&#20917;&#19979;&#21435;&#27427;&#36175;&#36825;&#20010;&#19990;&#30028;&#30340;
   &#32654;&#20029;&#12290;&#36825;&#20010;&#24471;&#24863;&#35874;&#30001; &lt;b&gt;&#31890;&#23376;&#25968;&#25454;&#32452;&#32455;&lt;/b&gt; (&lt;a href="http://pdg.lbl.gov/"&gt;Particle Data Group&lt;/a&gt;) &#21046;&#20316;&#30340; &lt;b&gt;&#31890;&#23376;&#22855;&#22659;&#20882;&#38505;&lt;/b&gt;
   &#32593;&#31449;&#12290;
&lt;ul&gt;
&lt;li&gt;&#33521;&#25991;&#31449;&#28857;&#65306; &lt;a href="http://www.particleadventure.org/"&gt;The Particle Adventure&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&#32321;&#20307;&#20013;&#25991;&#65306; &lt;a href="http://www.particleadventure.org/chinese/index.html"&gt;&#32654;&#22269;&#38236;&#20687;&lt;/a&gt;, &lt;a href="http://www.phy.ntnu.edu.tw/demolab/html.php?html=particleadventure/index"&gt;&#21488;&#28286;&#38236;&#20687;&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;/ol&gt;


&lt;p&gt;
&#26377;&#19968;&#28857;&#24819;&#24378;&#35843;&#19968;&#19979;&#65306;&#23613;&#31649;&#22312;&#19981;&#20855;&#22791;&#25968;&#23398;&#19982;&#29289;&#29702;&#30456;&#20851;&#22522;&#30784;&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#20173;&#28982;&#21487;&#20197;&#27427;&#36175;&#30446;&#21069;&#20154;&#31867;
&#23545;&#23431;&#23449;&#30340;&#35748;&#35782;&#65292;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#20165;&#38752;&#24819;&#35937;&#23601;&#21487;&#20197;&#24847;&#28139;&#30528;&#25512;&#32763;&#25110;&#32773;&#22823;&#20992;&#38420;&#26023;&#22320;&#20462;&#25913;&#29616;&#26377;&#30340;
&#29289;&#29702;&#23398;&#12289;&#23431;&#23449;&#23398;&#31561;&#12290;&#35831;&#24744; &lt;b&gt;&#29645;&#29233;&#29983;&#21629;&#65292;&#36828;&#31163;&#27665;&#31185;&#65281;&lt;/b&gt;
&lt;/p&gt;</content></entry><entry><title type="html">关于 dotsies 字体的想法</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/25_dotsies.html"/><updated>2012-03-25T19:23:00Z</updated><published>2012-03-25T19:23:00Z</published><id>blog/2012/03/25_dotsies.html</id><category scheme="/tags/295bb704f5205801d57d672780b94117.html" term="语言" label="语言"/><category scheme="/tags/ca746b1ff10193a3ce20878dec04a733.html" term="文字" label="文字"/><content type="html">&lt;p&gt;
&lt;a href="http://dotsies.org/"&gt;Dotsies&lt;/a&gt; &#26159;&#20351;&#29992;&#28857;&#20195;&#26367;&#24120;&#35268;&#23383;&#27597;&#20070;&#20889;&#30340;&#19968;&#31181;&#25289;&#19969;&#23383;&#27597;&#26174;&#31034;&#20307;&#31995;&#65292;&#27599;&#20010;&#23383;&#27597;&#30001;&#20116;&#20010;&#28857;&#30340;&#26174;&#38544;&#26469;
&#34920;&#31034;&#12290;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&#24819;&#27861;&#19968;&#65306;&#21046;&#20316;&#22362;&#25490;&#26174;&#31034;&#30340;&#23383;&#20307;&#12290;
&lt;/li&gt;
&lt;li&gt;&#24819;&#27861;&#20108;&#65306;&#25913;&#36827;&#65292;&#28155;&#21152;&#23450;&#20301;&#26631;&#35782;&#65292;&#29992;&#20110;&#22270;&#24418;&#35782;&#21035;&#12290;
&lt;/li&gt;
&lt;/ul&gt;




&lt;!-- link href='http://dotsies.org/dotsies.css' rel='stylesheet' type='text/css' --&gt;
&lt;script type="text/javascript"&gt;
function dotsies_hover() {
  var l = document.createElement('link');
  document.getElementsByTagName('head')[0].appendChild(l);
  l.setAttribute('href', 'http://dotsies.org/dotsies.css');
  l.setAttribute('type', 'text/css');
  l.setAttribute('rel', 'stylesheet');
  var s = document.createElement('style');
  document.getElementsByTagName('head')[0].appendChild(s);
  s.innerHTML = ('body, p, div, span, a, li, textarea, pre, input {font-family: Dotsies !important}');
}
&lt;/script&gt;
&lt;a href="javascript:dotsies_hover()"&gt;&#28857;&#36825;&#20799;&#35797;&#35797;&lt;/a&gt; Dotest &#30340;&#26679;&#23376;&#65306;&lt;a href="javascript:dotsies_hover()"&gt;See it in action&lt;/a&gt;.&lt;br /&gt;
&lt;pre&gt;
TRUST love even if it brings sorrow. 
Do not close up you heart.
&lt;/pre&gt;

&lt;p&gt;
(&#27880;&#65306;&#19978;&#36848;&#28436;&#31034;&#20195;&#30721;&#26469;&#33258;&#21338;&#23458; &lt;a href="http://allthingswordy.blogspot.com/2012/03/reading-dotsies.html"&gt;All Things Wordy&lt;/a&gt;.)
&lt;/p&gt;</content></entry><entry><title type="html">切换到 o-blog 页面系统</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/22_o-blog.html"/><updated>2012-03-22T04:45:00Z</updated><published>2012-03-22T04:45:00Z</published><id>blog/2012/03/22_o-blog.html</id><category scheme="/tags/orgmode.html" term="orgmode" label="orgmode"/><category scheme="/tags/ocd.html" term="OCD" label="OCD"/><content type="html">&lt;p&gt;
&#21407;&#26469;&#23581;&#35797;&#29992; &lt;a href="https://github.com/mojombo/jekyll"&gt;jekyll&lt;/a&gt; &#26469;&#21019;&#24314;&#33258;&#24049;&#30340;&#21338;&#23458;&#65292;&#20294;&#30495;&#30340;&#19981;&#20064;&#24815; ruby, &#36824;&#26159; org-mode &#29992;&#24471;&#26368;&#39034;&#25163;&#20102;&#12290;
&#21069;&#22825;&#21457;&#29616;&#20102;&#36825;&#20010; &lt;a href="https://github.com/renard/o-blog"&gt;o-blog&lt;/a&gt;, &#24863;&#35273;&#25402;&#22909;&#65292;&#23601;&#20999;&#25442;&#36807;&#26469;&#20102;&#12290;
&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="http://exaos.github.com/o-blog"&gt;o-blog &#30340;&#20013;&#25991;&#28436;&#31034;&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/exaos/o-blog"&gt;o-blog &#20013;&#25991;&#28436;&#31034;&#30340;&#28304;&#30721;&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;o-blog &#21407;&#22987;&#20195;&#30721;&#65306;&lt;a href="https://github.com/renard/o-blog"&gt;renard/o-blog&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;


&lt;p&gt;
&#20351;&#29992; &lt;a href="http://orgmode.org"&gt;orgmode&lt;/a&gt; &#21019;&#24314;&#38745;&#24577;&#39029;&#38754;&#30340;&#21338;&#23458;&#24863;&#35273;&#19981;&#38169;&#12290;&#22312; &lt;a href="http://orgmode.org/worg/"&gt;worg&lt;/a&gt; &#19978;&#26377;&#19968;&#20010;&#19987;&#38376;&#30340;&#39029;&#38754;&#20171;&#32461;&#36825;&#20010;&#24212;
&#29992;&#65306;&lt;a href="http://orgmode.org/worg/org-blog-wiki.html"&gt;Org Blogs and Wikis&lt;/a&gt;.
&lt;/p&gt;
&lt;p&gt;
&#22312; Wordpress, blogger, livejournal &#31561;&#30456;&#32487;&#34987;&#22269;&#20869;&#23553;&#38145;&#65292;&#23548;&#33268;&#20351;&#29992;&#19981;&#27491;&#24120;&#20043;&#21518;&#65292;&#20889;&#21338;&#23458;&#21407;
&#26469;&#24456;&#31616;&#21333;&#30340;&#20107;&#24773;&#23545;&#25105;&#21464;&#24471;&#26377;&#28857;&#22797;&#26434;&#12290;&#23613;&#31649;&#25105;&#19981;&#24895;&#24847;&#35752;&#35770;&#25919;&#27835;&#24615;&#35805;&#39064;&#65292;&#20294;&#20063;&#23454;&#22312;&#26080;&#27861;&#24525;&#21463;&#22269;&#20869;
&#30340;&#21338;&#23458;&#31995;&#32479;&#30340;&#35832;&#22810;&#38382;&#39064;&#65292;&#27604;&#22914;&#38544;&#31169;&#24615;&#20445;&#25252;&#12289;&#20851;&#38190;&#35789;&#23457;&#26597;&#12289;&#24191;&#21578;&#12289;&#31283;&#23450;&#24615;&#31561;&#65292;&#23545;&#20110;&#26377;&#35745;&#31639;&#26426;&#20351;
&#29992;&#27905;&#30294;&#30340;&#25105;&#65292;&#19968;&#20010;&#24178;&#20928;&#30340;&#20351;&#29992;&#31243;&#24207;&#33258;&#21160;&#29983;&#25104;&#30340;&#38745;&#24577;&#39029;&#38754;&#30340;&#21338;&#23458;&#31995;&#32479;&#23601;&#25104;&#20102;&#33258;&#28982;&#30340;&#39318;&#36873;&#12290;
&lt;/p&gt;</content></entry>
</feed>
