<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>心蛛小站</title>
  <link href="http://exaos.github.com/index.xml" rel="self" />
  <link href="http://exaos.github.com/"/>
  <updated>2012-04-03T13:52:25Z</updated>
  <id>http://exaos.github.com/index.xml</id>
  <entry><title type="html">联合国大学 (UNU)</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/28_UNU.html"/><updated>2012-03-28T14:14:00Z</updated><published>2012-03-28T14:14:00Z</published><id>blog/2012/03/28_UNU.html</id><category scheme="/tags/ce4ba240fbd95d4863684f78453c8877.html" term="社会" label="社会"/><category scheme="/tags/8640cb1581c2ae2de5a1462405b2943b.html" term="教育" label="教育"/><content type="html">&lt;p&gt;
&#20197;&#21069;&#26377;&#20010;&#20013;&#21307;&#39575;&#23376;&#21016;&#22826;&#21307;&#65292;&#33258;&#31216;&#33719;&#24471;&#32852;&#21512;&#22269;&#22823;&#23398;&#31185;&#23398;&#19982;&#21307;&#23398;&#21452;&#21338;&#22763;&#12290;&#21407;&#20197;&#20026;&#36825;&#20010;&#8220;&#32852;&#21512;&#22269;&#22823;&#23398;&#8221;&#26159;&#23376;&#34394;&#20044;&#26377;&#30340;&#65292;&#20180;&#32454;&#38405;&#35835;&#20102;&#19968;&#20123; &lt;a href="http://www.un.org"&gt;&#32852;&#21512;&#22269;&lt;/a&gt; &#30456;&#20851;&#20869;&#23481;&#21518;&#65292;&#25105;&#30693;&#36947;&#33258;&#24049;&#38169;&#20102;&#12290;&#20851;&#20110;&#8220;&#32852;&#21512;&#22269;&#22823;&#23398;&#8221;&#30340;&#20449;&#24687;&#21442;&#35265;&#65306;&lt;a href="http://unu.edu/about"&gt;&#32852;&#21512;&#22269;&#22823;&#23398;&#20171;&#32461;&lt;/a&gt; &#20197;&#21450; &lt;a href="http://www.un.org/zh/development/progareas/global/research.shtml"&gt;&#32852;&#21512;&#22269;&#30740;&#31350;&#19982;&#22521;&#35757;&#20869;&#23481;&lt;/a&gt;&#12290;
&lt;/p&gt;
&lt;p&gt;
&lt;a href="http://unu.edu/" alt="&#32852;&#21512;&#22269;&#22823;&#23398;&#22270;&#26631;" title="&#32852;&#21512;&#22269;&#22823;&#23398;&#22270;&#26631;" align="center"&gt;&lt;img src="http://unu.edu/wp-content/mu-plugins/unu-framework/Common/BluePrint/images/logo.gif" alt="logo.gif"/&gt;&lt;/a&gt;
&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#22269;&#22823;&#23398;&#26159;&#32852;&#21512;&#22269;&#31995;&#32479;&#20013;&#30340;&#23398;&#26415;&#20998;&#25903;&#65292;&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#39046;&#22495;&#24320;&#23637;&#19968;&#20123;&#30740;&#31350;&#19982;&#25945;&#32946;&#27963;&#21160;&#65292;&#20854;&#29305;&#21035;&#30446;&#30340;&#26159;&#36741;&#21161;&#21457;&#23637;&#20013;&#22269;&#23478;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#23427;&#30001;&#32852;&#21512;&#22269;&#22823;&#20250;&#20110;1973&#24180;&#21019;&#31435;&#65292;&#26088;&#22312;&#25104;&#20026;&#8220;&#19968;&#20010;&#22269;&#38469;&#24615;&#30340;&#23398;&#26415;&#31038;&#22242;&#65292;&#20026;&#20419;&#36827;&#32852;&#21512;&#22269;&#23466;&#31456;&#30340;&#30446;&#30340;&#19982;&#21407;&#21017;&#32780;&#24320;&#23637;&#30740;&#31350;&#12289;&#36827;&#20462;&#19982;&#26222;&#21450;&#24037;&#20316;&#8221;&#12290;&#32852;&#21512;&#22269;&#22823;&#23398;&#36890;&#36807;&#20840;&#29699;&#24615;&#30340;&#32852;&#21512;&#30740;&#31350;&#26426;&#26500;&#36827;&#34892;&#36816;&#20316;&#65292;&#22312;&#20301;&#20110;&#19996;&#20140;&#30340;&#32852;&#21512;&#22269;&#22823;&#23398;&#20013;&#24515;&#30340;&#25351;&#23548;&#19979;&#25191;&#34892;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#32852;&#21512;&#22269;&#22823;&#23398;&#24535;&#22312;&#25104;&#20026;&#22269;&#38469;&#19968;&#27969;&#30340;&#30740;&#31350;&#12289;&#25945;&#32946;&#21644;&#33021;&#21147;&#22521;&#20859;&#30340;&#30740;&#31350;&#26426;&#26500;&#65292;&#22312;&#21644;&#24179;&#12289;&#21457;&#23637;&#21644;&#21487;&#25345;&#32493;&#24615;&#26041;&#38754;&#25552;&#20379;&#20840;&#29699;&#24615;&#30340;&#25351;&#23548;&#12290;&#32852;&#21512;&#22269;&#22823;&#23398;&#20316;&#20026;&#32852;&#21512;&#22269;&#31995;&#32479;&#30340;&#26234;&#22218;&#22242;&#65292;&#22312;&#32852;&#21512;&#22269;&#12289;&#22269;&#38469;&#23398;&#26415;&#30028;&#21644;&#25919;&#31574;&#21046;&#23450;&#22242;&#20307;&#38388;&#29301;&#32447;&#25645;&#26725;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#20026;&#23547;&#27714;&#24212;&#23545;&#20840;&#29699;&#24615;&#25361;&#25112;&#30340;&#21487;&#25345;&#32493;&#35299;&#20915;&#26041;&#26696;&#36827;&#34892;&#31995;&#32479;&#24615;&#30340;&#25506;&#32034;&#65292;&#22823;&#23398;&#30340;&#27963;&#21160;&#21487;&#20998;&#20026;&#20116;&#31867;&#30456;&#20114;&#20132;&#32455;&#30340;&#39046;&#22495;&#65306;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&#21644;&#24179;&#12289;&#23433;&#20840;&#21644;&#20154;&#26435;
&lt;/li&gt;
&lt;li&gt;&#21457;&#23637;&#31649;&#29702;
&lt;/li&gt;
&lt;li&gt;&#20154;&#21475;&#21644;&#20581;&#24247;
&lt;/li&gt;
&lt;li&gt;&#20840;&#29699;&#21464;&#21270;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;
&lt;/li&gt;
&lt;li&gt;&#31185;&#23398;&#12289;&#25216;&#26415;&#21644;&#31038;&#20250;
&lt;/li&gt;
&lt;/ul&gt;

</content></entry><entry><title type="html">用中子探测器识别核武器</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/27_4207ab14665cc8d016faa74461b58c5d.html"/><updated>2012-03-27T23:37:00Z</updated><published>2012-03-27T23:37:00Z</published><id>blog/2012/03/27_4207ab14665cc8d016faa74461b58c5d.html</id><category scheme="/tags/920632dabac77e0e51002a969396ea04.html" term="物理" label="物理"/><content type="html">&lt;p&gt;
&#21407;&#25991;&#65306;Neutron detector can identify presence of nuclear weapons
&lt;a href="http://goo.gl/E4WWZ" target="_blank"&gt;&lt;img src="http://goo.gl/048rz" /&gt;&lt;/a&gt;

&#29275;&#27941;&#22823;&#23398;&#21644;&#20262;&#25958;&#24093;&#22269;&#23398;&#38498;&#30340;&#31185;&#23398;&#23478;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#20302;&#25104;&#26412;&#12289;&#39640;&#28789;&#25935;&#30340;&#20013;&#23376;&#25506;&#27979;&#22120;&#65292;&#21487;&#29992;&#20110;&#35782;&#21035;&#26680;&#27494;&#22120;&#12290;&#20013;&#23376;&#25506;&#27979;&#22120;&#21253;&#21547;&#30340;&#21457;&#20809;&#37096;&#20214;&#31216;&#20043;&#20026;&#38378;&#28865;&#20307;&#65292;&#36825;&#26159;&#20013;&#23376;&#19982;&#20043;&#21457;&#29983;&#21453;&#24212;&#30340;&#22320;&#26041;&#12290;&#20197;&#21069;&#36890;&#24120;&#20351;&#29992;&#27686;-3&#20803;&#32032;&#20316;&#20026;&#38378;&#28865;&#20307;&#12290;&#21313;&#22810;&#24180;&#21069;&#65292;&#32654;&#22269;&#30340;&#35768;&#22810;&#20891;&#24037;&#39033;&#30446;&#37117;&#33021;&#22815;&#29983;&#20135;&#27686;-3&#65292;&#29616;&#22312;&#36825;&#20123;&#39033;&#30446;&#22810;&#25968;&#24050;&#32463;&#32467;&#26463;&#65292;&#24182;&#19988;&#27686;-3&#22312;&#21307;&#29992;&#21644;&#31185;&#23398;&#30740;&#31350;&#19978;&#20351;&#29992;&#20063;&#36234;&#26469;&#36234;&#24191;&#27867;&#65292;&#23548;&#33268;&#20215;&#26684;&#39134;&#28072;&#12290;&#35813;&#22242;&#38431;&#29616;&#22312;&#35774;&#35745;&#30340;&#25506;&#27979;&#22120;&#20351;&#29992;&#30340;&#26159;&#38146;-6&#20803;&#32032;&#20316;&#20026;&#38378;&#28865;&#20307;&#65292;&#36825;&#31181;&#20803;&#32032;&#30340;&#33258;&#28982;&#30028;&#21547;&#37327;&#20016;&#23500;&#65292;&#20215;&#26684;&#20063;&#24456;&#20415;&#23452;&#12290;&#24182;&#19988;&#36825;&#31181;&#26032;&#30340;&#25506;&#27979;&#22120;&#21487;&#26377;&#25928;&#21306;&#20998;&#20285;&#29595;&#23556;&#32447;&#30340;&#20449;&#21495;&#65292;&#35823;&#25253;&#35686;&#30340;&#27010;&#29575;&#20063;&#27604;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
&#20854;&#23454;&#65292;&#36825;&#31181;&#20013;&#23376;&#25506;&#27979;&#22120;&#19981;&#31639;&#20160;&#20040;&#26032;&#40092;&#30340;&#19996;&#35199;&#12290;&#20294;&#22914;&#26524;&#22312;&#28023;&#20851;&#12289;&#36828;&#33322;&#31561;&#22320;&#26041;&#30340;&#21361;&#38505;&#22120;&#26816;&#27979;&#20043;&#31867;&#24212;&#29992;&#19978;&#24471;&#21040;&#24191;&#27867;&#25512;&#24191;&#20063;&#19981;&#38169;&#12290;
&lt;/p&gt;</content></entry><entry><title type="html">一些关于宇宙与粒子物理的科普网站作品</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/27_cosmos.html"/><updated>2012-03-27T09:48:00Z</updated><published>2012-03-27T09:48:00Z</published><id>blog/2012/03/27_cosmos.html</id><category scheme="/tags/920632dabac77e0e51002a969396ea04.html" term="物理" label="物理"/><category scheme="/tags/4a27f6167d4c1d052343a084b6a90b10.html" term="科学" label="科学"/><content type="html">&lt;p&gt;
&#21407;&#26469;&#22312; &lt;a href="http://weibo.com/1746729234/yalyzwZ4x"&gt;&#26032;&#28010;&#24494;&#21338;&lt;/a&gt; &#19978;&#21457;&#24067;&#36807;&#36825;&#26465;&#28040;&#24687;&#12290;&#22240;&#20026;&#35273;&#24471;&#36825;&#26159;&#20123;&#24456;&#26834;&#30340;&#19996;&#35199;&#65292;&#20540;&#24471;&#35760;&#24518;&#65292;&#25925;&#22312;&#36825;&#20799;&#25972;&#29702;&#19968;&#19979;&#12290;
&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&#20320;&#26159;&#19981;&#26159;&#20250;&#22909;&#22855;&#65306;&#25105;&#20204;&#23431;&#23449;&#30340;&#23610;&#24230;&#31350;&#31455;&#26377;&#22810;&#22823;&#21602;&#65311;&#20854;&#23454;&#65292;&#30446;&#21069;&#20154;&#31867;&#25152;&#35748;&#35782;&#30340;&#23431;&#23449;&#21487;&#20197;&#35828;&#24050;&#32463;&#36828;&#36828;&#36229;&#20986;&#20102;&#26222;&#36890;&#20154;&#30340;&#30452;&#35266;&#24863;&#21463;&#33539;&#22260;&#12290;&#20294;&#25105;&#20204;&#20173;&#28982;&#21487;&#20197;&#27604;&#36739;&#24418;&#35937;&#22320;&#20307;&#39564;&#19968;&#19979;&#36825;&#20010;&#35748;&#35782;&#30340;&#23610;&#24230;&#65292;&#27427;&#36175;&#19968;&#19979;&#30001; Cary Huang &#25152;&#21046;&#20316;&#30340; flash &amp;mdash; &lt;a href="http://htwins.net/scale2/scale2.swf"&gt;&lt;b&gt;&#23431;&#23449;&#30340;&#23610;&#24230; 2&lt;/b&gt;&lt;/a&gt; (The Scale of the Universe 2). &#30446;&#21069;&#36824;&#27809;&#26377;&#32763;&#35793;&#25104;&#20013;&#25991;&#65292;&#27427;&#36175;&#26102;&#35831;&#24102;&#19978;&#35789;&#20856;&#12290;&#65339;&#27880;&#65306;&#25105;&#23545; Flash &#25216;&#26415;&#19981;&#24863;&#20852;&#36259;&#65292;&#22914;&#26524;&#26377;&#20154;&#24819;&#21046;&#20316;&#31867;&#20284;&#30340; HTML5/CSS &#39029;&#38754;&#65292;&#35831;&#19968;&#23450;&#21578;&#20043;&#25105;&#65281;&#21478;&#22806;&#65292;&#36825;&#20010;&#31449;&#28857;&#26368;&#21021;&#26159;&#20174; &lt;b&gt;&#26446;&#28156;&#22312;&#24494;&#21338;&lt;/b&gt; &#22312;&#26032;&#28010;&#19978;&#20998;&#20139;&#26102;&#25152;&#24471;&#65292;&#29305;&#27492;&#24863;&#35874;&#12290;&#65341;
&lt;/li&gt;
&lt;li&gt;&#21516;&#26679;&#65292;&#23545;&#20110;&#25105;&#20204;&#25152;&#29983;&#23384;&#30340;&#23431;&#23449;&#30340;&#35748;&#35782;&#36824;&#26377;&#21478;&#19968;&#31181;&#20197;&#26102;&#38388;&#26469;&#23637;&#29616;&#30340;&#26041;&#24335;&#65292;&#36825;&#23601;&#26159;&#24494;&#36719;&#30740;&#31350;&#20013;&#24515;&#12289;&#21152;&#24030;&#22823;&#23398;&#20271;&#20811;&#21033;&#20998;&#26657;&#21450;&#33707;&#26031;&#31185;&#24030;&#31435;&#22823;&#23398;&#25152;&#24102;&#26469;&#30340; &lt;a href="http://www.chronozoomproject.org/"&gt;&lt;b&gt;&#26102;&#38388;&#32553;&#25918;&#24037;&#31243;&lt;/b&gt;&lt;/a&gt; (ChronoZoom)&#12290;&#30475;&#30475;&#22312;&#26102;&#38388;&#30340;&#23610;&#24230;&#19978;&#20154;&#31867;&#30340;&#37027;&#31181;&#23490;&#23518;&#12290;
&lt;/li&gt;
&lt;li&gt;&#31890;&#23376;&#29289;&#29702;&#23545;&#26222;&#36890;&#20154;&#32780;&#35328;&#65292;&#26159;&#38750;&#24120;&#31070;&#31192;&#30340;&#19996;&#35199;&#12290;&#20854;&#23454;&#65292;&#23545;&#23427;&#30340;&#20102;&#35299;&#23613;&#31649;&#38656;&#35201;&#19968;&#23450;&#30340;&#22522;&#30784;&#30693;&#35782;&#65292;&#20294;&#20063;&#24182;&#38750;&#37027;&#20040;&#39640;&#19981;&#21487;&#25856;&#65292;&#20320;&#20063;&#21487;&#20197;&#22312;&#19981;&#20855;&#22791;&#25968;&#23398;&#29289;&#29702;&#22522;&#30784;&#30340;&#24773;&#20917;&#19979;&#21435;&#27427;&#36175;&#36825;&#20010;&#19990;&#30028;&#30340;&#32654;&#20029;&#12290;&#36825;&#20010;&#24471;&#24863;&#35874;&#30001; &lt;b&gt;&#31890;&#23376;&#25968;&#25454;&#32452;&#32455;&lt;/b&gt; (&lt;a href="http://pdg.lbl.gov/"&gt;Particle Data Group&lt;/a&gt;) &#21046;&#20316;&#30340; &lt;b&gt;&#31890;&#23376;&#22855;&#22659;&#20882;&#38505;&lt;/b&gt; &#32593;&#31449;&#12290;
&lt;ul&gt;
&lt;li&gt;&#33521;&#25991;&#31449;&#28857;&#65306; &lt;a href="http://www.particleadventure.org/"&gt;The Particle Adventure&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&#32321;&#20307;&#20013;&#25991;&#65306; &lt;a href="http://www.particleadventure.org/chinese/index.html"&gt;&#32654;&#22269;&#38236;&#20687;&lt;/a&gt;, &lt;a href="http://www.phy.ntnu.edu.tw/demolab/html.php?html=particleadventure/index"&gt;&#21488;&#28286;&#38236;&#20687;&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;

&lt;/li&gt;
&lt;/ol&gt;


&lt;p&gt;
&#26377;&#19968;&#28857;&#24819;&#24378;&#35843;&#19968;&#19979;&#65306;&#23613;&#31649;&#22312;&#19981;&#20855;&#22791;&#25968;&#23398;&#19982;&#29289;&#29702;&#30456;&#20851;&#22522;&#30784;&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#20173;&#28982;&#21487;&#20197;&#27427;&#36175;&#30446;&#21069;&#20154;&#31867;&#23545;&#23431;&#23449;&#30340;&#35748;&#35782;&#65292;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#20165;&#38752;&#24819;&#35937;&#23601;&#21487;&#20197;&#24847;&#28139;&#30528;&#25512;&#32763;&#25110;&#32773;&#22823;&#20992;&#38420;&#26023;&#22320;&#20462;&#25913;&#29616;&#26377;&#30340;&#29289;&#29702;&#23398;&#12289;&#23431;&#23449;&#23398;&#31561;&#12290;&#35831;&#24744; &lt;b&gt;&#29645;&#29233;&#29983;&#21629;&#65292;&#36828;&#31163;&#27665;&#31185;&#65281;&lt;/b&gt;
&lt;/p&gt;</content></entry><entry><title type="html">关于 dotsies 字体的想法</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/25_dotsies.html"/><updated>2012-03-25T19:23:00Z</updated><published>2012-03-25T19:23:00Z</published><id>blog/2012/03/25_dotsies.html</id><category scheme="/tags/295bb704f5205801d57d672780b94117.html" term="语言" label="语言"/><category scheme="/tags/ca746b1ff10193a3ce20878dec04a733.html" term="文字" label="文字"/><content type="html">&lt;p&gt;
&lt;a href="http://dotsies.org/"&gt;Dotsies&lt;/a&gt; &#26159;&#20351;&#29992;&#28857;&#20195;&#26367;&#24120;&#35268;&#23383;&#27597;&#20070;&#20889;&#30340;&#19968;&#31181;&#25289;&#19969;&#23383;&#27597;&#26174;&#31034;&#20307;&#31995;&#65292;&#27599;&#20010;&#23383;&#27597;&#30001;&#20116;&#20010;&#28857;&#30340;&#26174;&#38544;&#26469;&#34920;&#31034;&#12290;
&lt;/p&gt;&lt;ul&gt;
&lt;li&gt;&#24819;&#27861;&#19968;&#65306;&#21046;&#20316;&#22362;&#25490;&#26174;&#31034;&#30340;&#23383;&#20307;&#12290;
&lt;/li&gt;
&lt;li&gt;&#24819;&#27861;&#20108;&#65306;&#25913;&#36827;&#65292;&#28155;&#21152;&#23450;&#20301;&#26631;&#35782;&#65292;&#29992;&#20110;&#22270;&#24418;&#35782;&#21035;&#12290;
&lt;/li&gt;
&lt;/ul&gt;




&lt;!-- link href='http://dotsies.org/dotsies.css' rel='stylesheet' type='text/css' --&gt;
&lt;script type="text/javascript"&gt;
function dotsies_hover() {
  var l = document.createElement('link');
  document.getElementsByTagName('head')[0].appendChild(l);
  l.setAttribute('href', 'http://dotsies.org/dotsies.css');
  l.setAttribute('type', 'text/css');
  l.setAttribute('rel', 'stylesheet');
  var s = document.createElement('style');
  document.getElementsByTagName('head')[0].appendChild(s);
  s.innerHTML = ('body, p, div, span, a, li, textarea, pre, input {font-family: Dotsies !important}');
}
&lt;/script&gt;
&lt;a href="javascript:dotsies_hover()"&gt;&#28857;&#36825;&#20799;&#35797;&#35797;&lt;/a&gt; Dotest &#30340;&#26679;&#23376;&#65306;&lt;a href="javascript:dotsies_hover()"&gt;See it in action&lt;/a&gt;.&lt;br /&gt;
&lt;pre&gt;
TRUST love even if it brings sorrow. 
Do not close up you heart.
&lt;/pre&gt;

&lt;p&gt;
(&#27880;&#65306;&#19978;&#36848;&#28436;&#31034;&#20195;&#30721;&#26469;&#33258;&#21338;&#23458; &lt;a href="http://allthingswordy.blogspot.com/2012/03/reading-dotsies.html"&gt;All Things Wordy&lt;/a&gt;.)
&lt;/p&gt;</content></entry><entry><title type="html">切换到 o-blog 页面系统</title><author><name>nil</name></author><link href="http://exaos.github.com//blog/2012/03/22_aeda1ad134391065aba93d91713c7386.html"/><updated>2012-03-22T04:45:00Z</updated><published>2012-03-22T04:45:00Z</published><id>blog/2012/03/22_aeda1ad134391065aba93d91713c7386.html</id><category scheme="/tags/d41668dae176276ad74635757ce6e080.html" term="orgmode" label="orgmode"/><category scheme="/tags/cf43d9b315407fd561c9ec352129d6ca.html" term="OCD" label="OCD"/><content type="html">&lt;p&gt;
&#21407;&#26469;&#23581;&#35797;&#29992; &lt;a href="https://github.com/mojombo/jekyll"&gt;jekyll&lt;/a&gt; &#26469;&#21019;&#24314;&#33258;&#24049;&#30340;&#21338;&#23458;&#65292;&#20294;&#30495;&#30340;&#19981;&#20064;&#24815; ruby, &#36824;&#26159; org-mode &#29992;&#24471;&#26368;&#39034;&#25163;&#20102;&#12290;&#21069;&#22825;&#21457;&#29616;&#20102;&#36825;&#20010; &lt;a href="https://github.com/renard/o-blog"&gt;o-blog&lt;/a&gt;, &#24863;&#35273;&#25402;&#22909;&#65292;&#23601;&#20999;&#25442;&#36807;&#26469;&#20102;&#12290;
&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="http://exaos.github.com/o-blog"&gt;o-blog &#30340;&#20013;&#25991;&#28436;&#31034;&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/exaos/o-blog"&gt;o-blog &#20013;&#25991;&#28436;&#31034;&#30340;&#28304;&#30721;&lt;/a&gt;
&lt;/li&gt;
&lt;li&gt;o-blog &#21407;&#22987;&#20195;&#30721;&#65306;&lt;a href="https://github.com/renard/o-blog"&gt;renard/o-blog&lt;/a&gt;
&lt;/li&gt;
&lt;/ul&gt;


&lt;p&gt;
&#20351;&#29992; &lt;a href="http://orgmode.org"&gt;orgmode&lt;/a&gt; &#21019;&#24314;&#38745;&#24577;&#39029;&#38754;&#30340;&#21338;&#23458;&#24863;&#35273;&#19981;&#38169;&#12290;&#22312; &lt;a href="http://orgmode.org/worg/"&gt;worg&lt;/a&gt; &#19978;&#26377;&#19968;&#20010;&#19987;&#38376;&#30340;&#39029;&#38754;&#20171;&#32461;&#36825;&#20010;&#24212;&#29992;&#65306;&lt;a href="http://orgmode.org/worg/org-blog-wiki.html"&gt;Org Blogs and Wikis&lt;/a&gt;.
&lt;/p&gt;</content></entry>
</feed>
